# Homework Guide

In [1]:
import json
import pymysql 

pymysql.install_as_MySQLdb()

with open('cred.json') as f:
    creds = json.load(f)

connection_string = "mysql://{user}:{password}@{host}".format(**creds)

In [2]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql $connection_string

'Connected: dimitri@None'

### Increasing complexity of queries

In [ ]:
%%sql

USE shared_schedule

In [ ]:
%%sql

-- 8.4  Show students with grade of 85+ in Art in any Computer course

SELECT * 
FROM Students
WHERE StudentID in (
    SELECT StudentID 
    FROM Student_Schedules NATURAL JOIN Classes NATURAL JOIN Subjects
    WHERE Grade >= 85 and CategoryID = "ART") 
                                         AND 
    StudentID in (
    SELECT StudentID 
    FROM Student_Schedules NATURAL JOIN Classes NATURAL JOIN Subjects
    WHERE Grade >= 85 and CategoryID = "CIS")

In [ ]:
%%sql
SELECT * FROM 
(SELECT StudentID, Grade grade1, CategoryId category1
FROM Student_Schedules NATURAL JOIN Classes NATURAL JOIN Subjects) as s1
NATURAL JOIN 
(SELECT StudentID, Grade grade2, CategoryId category2
FROM Student_Schedules NATURAL JOIN Classes NATURAL JOIN Subjects) as s2
WHERE grade1 >= 85 and grade2 >= 85 and category1 = "CIS" and category2 = "ART"

In [ ]:
%%sql

USE shared_sales

In [ ]:
%%sql

-- 9.3 Products and dates for any orders

SELECT DISTINCT ProductNumber, OrderDate 
FROM order_details NATURAL JOIN orders
ORDER BY ProductNumber, OrderDate

In [ ]:
%%sql

use shared_sales;

In [ ]:
%%sql

In [ ]:
%%sql

-- 14.2  Part 1. Total sales per product

SELECT products.*, sum(QuotedPrice * QuantityOrdered) total_sales
FROM products NATURAL LEFT JOIN order_details
GROUP BY ProductNumber

In [ ]:
%%sql

-- 14.2 Part 2. Average sales per category 

SELECT categories.*, avg(total_sales) category_average
FROM categories NATURAL LEFT JOIN (
    SELECT products.*, sum(QuotedPrice * QuantityOrdered) total_sales
    FROM products NATURAL LEFT JOIN order_details
    GROUP BY ProductNumber) as a
GROUP BY CategoryID

In [ ]:
%%sql

-- 14.2 Final Solution

SELECT ProductNumber, ProductName, CategoryID, total_sales, category_average 

FROM 

(SELECT products.*, sum(QuotedPrice * QuantityOrdered) total_sales
FROM products NATURAL LEFT JOIN order_details
GROUP BY ProductNumber) q1 

NATURAL JOIN

(SELECT categories.*, avg(total_sales) category_average
FROM categories NATURAL LEFT JOIN (
    SELECT products.*, sum(QuotedPrice * QuantityOrdered) total_sales
    FROM products NATURAL LEFT JOIN order_details
    GROUP BY ProductNumber) as a
GROUP BY CategoryID) q2

WHERE total_sales > category_average

In [ ]:
product_sales = product.aggr(order_details, total_sales=sum(QuotedPrice * QuantityOrder))

category_average = category.aggr(product_sales, category_average = avg(total_sales))

successful_products = product_sales * category_average & (total_sales > category_average)

In [3]:
%%sql

use shared_schedule

 * mysql://dimitri:***@db.data-science-ust.net
0 rows affected.

[]

In [10]:
%%sql

-- 13.1  Category name and count of classes

SELECT CategoryID, count(ClassID) 
FROM Subjects NATURAL LEFT JOIN Classes
GROUP BY CategoryID

 * mysql://dimitri:***@db.data-science-ust.net
16 rows affected.

[('ACC', 6),
 ('ART', 16),
 ('BIO', 6),
 ('BUS', 0),
 ('CHE', 8),
 ('CIS', 6),
 ('CSC', 4),
 ('ECO', 12),
 ('ENG', 14),
 ('GEG', 4),
 ('HIS', 8),
 ('JRN', 2),
 ('MAT', 24),
 ('MUS', 8),
 ('PHY', 8),
 ('POL', 6)]